
/*
Завдання 2

Використовуючи IntelliJ IDEA, створіть проект.

Дано значення числа pi, яке дорівнює 3,141592653 та значення числа Ейлера е, яке дорівнює 2,7182818284590452.
Створіть дві змінні, присвойте їм значення числа pi та числа е та виведіть їх на екран без втрати точності.
 */

public class exercise2_2 {
    public static void main(String[] args) {
        double e = Math.E;
        double pi = Math.PI;
       double test = 2.718281828459045E17;
        System.out.println(e);
        System.out.println(pi);
        System.out.println(test);
    }
}
