/*
Завдання 3

Використовуючи IntelliJ IDEA, створіть проект.

Створіть три рядкові змінні та надайте їм значення:

"\nмій рядок 1"

"\tмій рядок 2"

"\aмій рядок 3"

Виведіть значення кожної змінної на екран. Які відмінності ви побачили? Зробіть висновки.
 */
public class exercise2_3 {
    public static void main(String[] args) {
    String s1 = "\nмій рядок 1";// це працює - є перенос на наступну строку перед воводом на екран.
    String s2 = "\tмій рядок 2";// і це працює - вставляеться символ табуляції перед текстом.
        // String s3 = "\aмій рядок 3";// а це не працю бо джава не знає такого керуючого символа ( не існує).
        // Щоб вивести цей текст на екран порібного його екранувати додавши ще один слеш.
        String s3 = "\\aмій рядок 3";
        System.out.println(s1);
        System.out.println(s2);
        System.out.println(s3);
    }
}
